/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.6lowpanworld.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           gsmmux_0710.h
** Last modified Date:  2017-11-11
** Last Version:        v1.00
** Description:         gsm0710基本函数实现
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo
** Created date:        2017-11-11
** Version:             v1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:                
** Description:         
*********************************************************************************************************/
#ifndef __GSMMUX_0710_H__
#define __GSMMUX_0710_H__

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>
#include <rtthread.h>
  
/*********************************************************************************************************
**  协议格式头部的一些定义
*********************************************************************************************************/
// basic mode flag for frame start and end
#define GSM0710_BASIC_FLAG      0xF9
// advanced mode flag for frame start and end
#define GSM0710_ADV_FLAG        0x7E
// advanced mode escape symbol
#define GSM0710_ADV_ESC         0x7D
// advanced mode escape complement mask
#define GSM0710_ADV_ESC_COPML   0x20
// advanced mode escaped symbols: Flag, Escape, XON and XOFF
#define ADV_ESCAPED_SYMS        {GSM0710_ADV_FLAG, GSM0710_ADV_ESC, 0x11, 0x91, 0x13, 0x93 }

/*********************************************************************************************************
**  地址字节控制位定义
*********************************************************************************************************/
#define GSM0710_EA              0x01
#define GSM0710_CR              0x02
  
/*********************************************************************************************************
**  控制字节控制位定义
*********************************************************************************************************/
#define GSM0710_PF              0x10
#define GSM0710_SABM            0x2F
#define GSM0710_UA              0x63
#define GSM0710_DM              0x0F
#define GSM0710_DISC            0x43
#define GSM0710_UIH             0xEF
#define GSM0710_UI              0x03

/*********************************************************************************************************
**  控制通道的命令定义
*********************************************************************************************************/
#define GSM0710_CMD_PSC         0x41
#define GSM0710_CMD_CLD         0xC1
#define GSM0710_CMD_TEST        0x21
#define GSM0710_CMD_MSC         0xE1
#define GSM0710_CMD_FCOFF       0x61
#define GSM0710_CMD_FCON        0xA1
#define GSM0710_CMD_NSC         0x11

/*********************************************************************************************************
**  V.24控制字节相关定义
*********************************************************************************************************/
#define GSM0710_V_24_FC         0x02
#define GSM0710_V_24_RTC        0x04
#define GSM0710_V_24_RTR        0x08
#define GSM0710_V_24_IC         0x40
#define GSM0710_V_24_DV         0x80

/*********************************************************************************************************
**  帧格式判断宏定义
*********************************************************************************************************/
#define GSM0710_FRAME_IS(control, type)         (((control) & ~GSM0710_PF) == (type))
#define GSM0710_COMMAND_IS(type, command)       (((type) & ~GSM0710_CR) == (command))
#define GSM0720_PF_ISSET(control)               ((control & GSM0710_PF) == GSM0710_PF)
  
/*********************************************************************************************************
**  实现的外部函数声明
*********************************************************************************************************/
extern int gsmmux_init(const char *name,uint32_t baud, 
                         void(*power_ctrl)(void), int(*enter_mux)(rt_device_t handle, uint8_t *buffer));
extern void gsmmux_reset(void);
extern uint8_t gsmmux_status(void);


#ifdef __cplusplus
    }
#endif      // __cplusplus
    
#endif      // __GSMMUX_0710_H__
/*********************************************************************************************************
END FILE
*********************************************************************************************************/
