/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.6lowpanworld.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           DeviceInit.c
** Last modified Date:  2014-04-09
** Last Version:        v1.0
** Description:         设备参数初始化
**
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo任海波
** Created date:        2014-04-09
** Version:             v1.0
** Descriptions:        The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/
#include <string.h>
#include <stdio.h>
#include <rthw.h>
#include <rtthread.h>
#include <rtdevice.h>

#include "Main.h"

/*********************************************************************************************************
** Function name:       DeviceParamInit
** Descriptions:        设备参数初始化，从配置文件中读取参数，如果不存在，则采用默认参数
** input parameters:    NONE
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void DeviceParamInit(void)
{
}

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
